# StairsRailingBalusterSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingBalusterSpacing Property
ParameterTypeId Class See Also
---
"Baluster Separation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingBalusterSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingBalusterSpacing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingBalusterSpacing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace